a:3:{s:4:"time";i:1460625287;s:3:"ttl";i:600;s:5:"value";a:32:{s:4:"name";s:13:"Shop-Script 6";s:7:"version";s:11:"6.3.0.44568";s:15:"update_datetime";s:19:"2015-12-25 07:40:08";s:7:"license";s:2:"WA";s:11:"license_url";N;s:12:"license_text";N;s:7:"summary";s:52:"Прибыльный интернет-магазин";s:4:"icon";s:61:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.png";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.16x16.png";}s:6:"vendor";s:8:"webasyst";s:11:"vendor_name";s:8:"Webasyst";s:7:"support";s:32:"https://www.shop-script.ru/help/";s:3:"url";s:25:"http://www.shop-script.ru";s:8:"demo_url";s:27:"http://demo-ru.webasyst.com";s:10:"commercial";b:1;s:9:"purchased";N;s:12:"purchase_url";s:33:"https://www.webasyst.com/my/apps/";s:14:"license_expire";N;s:9:"renew_url";N;s:5:"price";s:14:"14 999 руб.";s:11:"lease_price";N;s:11:"description";s:567:"<p>В Shop-Script 6 есть все для открытия интернет-магазина: более 250 полезных функций, которые позволят вам продавать больше. Shop-Script 6 является одним из самых функциональных скриптов интернет-магазина для малого и среднего бизнеса.</p>

<p>Подробное описание платформы на сайте Shop-Script 6: <a href="http://www.shop-script.ru">www.shop-script.ru</a></p>";s:11:"screenshots";a:9:{i:0;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3459/3459.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3459/3459.750.png";}i:1;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3460/3460.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3460/3460.750.png";}i:2;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3461/3461.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3461/3461.750.png";}i:3;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3462/3462.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3462/3462.750.png";}i:4;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3463/3463.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3463/3463.750.png";}i:5;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3464/3464.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3464/3464.750.png";}i:6;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3465/3465.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3465/3465.750.png";}i:7;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3466/3466.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3466/3466.750.png";}i:8;a:3:{s:11:"description";s:0:"";s:5:"thumb";s:74:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3467/3467.70.png";s:3:"img";s:75:"http://www.webasyst.com/wa-data/public/updates/img/29/129/3467/3467.750.png";}}s:5:"pages";a:0:{}s:9:"changelog";a:84:{i:0;a:3:{s:7:"version";s:11:"6.3.0.44568";s:7:"content";s:168:"Исправлена работа плагинов, изменяющих цены товаров на витрине, при фильтрации в категории.";s:8:"datetime";s:19:"2015-12-25 07:39:25";}i:1;a:3:{s:7:"version";s:11:"6.3.0.44472";s:7:"content";s:1072:"— Добавлена возможность отображения кода основного артикула в списках товаров в бекенде.<br>
— Добавлена возможность использования разных названий магазина в уведомлениях, отправляемых для заказов, оформленных через разные витрины.<br>
— Добавлена настройка для бонусной программы, позволяющая ограничить количество бонусов, используемых при оплате заказа.<br>
— В настройках скидок добавлена возможность выбора вариантов сохранения описания расчета скидки в истории обработки заказов.<br>
— Исправлены ошибки округления цен.<br>
— Другие мелкие улучшения и исправления недочетов.";s:8:"datetime";s:19:"2015-12-23 09:14:15";}i:2;a:3:{s:7:"version";s:11:"6.2.1.43955";s:7:"content";s:993:"— Добавлена возможность отключения ленивой загрузки списков товаров в бекенде для включения постраничной навигации.<br>
— В свойствах витрины (поселения) добавлена настройка скрытия товаров, отсутствующих в наличии.<br>
— Улучшена фильтрация товаров по характеристикам, в том числе для учета артикулов, недоступных для продажи.<br>
— Улучшен механизм скидок, в том числе добавлена возможность применения скидок на отдельные товары в составе заказа.<br>
— Исправлены ошибки в функции экспорта товаров в CSV-файл.<br>
— Прочие мелкие исправления.";s:8:"datetime";s:19:"2015-11-27 07:56:11";}i:3;a:3:{s:7:"version";s:11:"6.2.0.42498";s:7:"content";s:407:"— Добавлена возможность экспорта и импорта дополнительных параметров товаров и категорий.<br>
— Исправлены ошибки экспорта товаров из подкатегорий выбранной корневой категории.<br>
— Исправление других мелких недочетов.";s:8:"datetime";s:19:"2015-09-29 09:43:02";}i:4;a:3:{s:7:"version";s:11:"6.2.0.42427";s:7:"content";s:64:"Исправлена ошибка с валютой заказа";s:8:"datetime";s:19:"2015-09-25 16:18:06";}i:5;a:3:{s:7:"version";s:11:"6.2.0.42413";s:7:"content";s:272:"Поддержка Webasyst TV и новые виджеты: источники продаж, KPI интернет-магазина, покупатели, товары.
Общесистемные улучшения, исправление найденных ошибок.";s:8:"datetime";s:19:"2015-09-25 06:14:11";}i:6;a:3:{s:7:"version";s:11:"6.1.1.41776";s:7:"content";s:232:"Обновление совместимости анти-спам защиты системы оформления заказов с некоторыми темами дизайна независимых разработчиков.";s:8:"datetime";s:19:"2015-09-04 08:51:49";}i:7;a:3:{s:7:"version";s:11:"6.1.1.41714";s:7:"content";s:1267:"— Анти-спам фильтрация заказов: добавлена защита системы оформления заказов от спама. Защита автоматически отвергает все заказы, оформляемые роботами, и работает полностью незаметно для реального покупателя или на основе капчи (ввода кода на изображении). Анти-спам фильтрация включается в разделе Настройки &gt; Оформление заказов.
— Добавлена возможность замены стандартной капчи на Google reCAPTCHA. Настраивается в разделе Настройки &gt; Общие настройки.
— Тема дизайна «Дефолт 3.1.0»: множественные визуальные улучшения, новые настройки для более простой начальной настройки внешнего вида интернет-магазина без изменения исходного кода шаблонов дизайна.
— Исправление незначительных ошибок.";s:8:"datetime";s:19:"2015-09-03 06:50:09";}i:8;a:3:{s:7:"version";s:11:"6.1.0.40999";s:7:"content";s:136:"Исправлена совместимость с плагинами для редактирования товаров в списке";s:8:"datetime";s:19:"2015-08-03 06:57:14";}i:9;a:3:{s:7:"version";s:11:"6.1.0.40967";s:7:"content";s:241:"Исправлены незначительные ошибки назначения прав доступа на изображения промо-карточек и отправки отложенных уведомлений (followupCli)";s:8:"datetime";s:19:"2015-07-31 09:33:31";}i:10;a:3:{s:7:"version";s:11:"6.1.0.40913";s:7:"content";s:352:"— В виджетах «Продажи» и «Заказы» добавлен учет прав доступа пользователей.<br>
— Исправлена ошибка автоматического формирования адреса (URL) по названию товара.<br>
— Незначительные улучшения.";s:8:"datetime";s:19:"2015-07-29 06:11:04";}i:11;a:3:{s:7:"version";s:11:"6.1.0.40856";s:7:"content";s:2459:"— Тема дизайна «Дефолт 3.0»: полностью новый внешний вид, новые настройки оформления главной страницы витрины магазина.<br>
— Хук orders_collection, позволяющий создавать плагины фильтрации (подбора) заказов в бекенде.<br>
— Редактирование цен на товары непосредственно в списках товаров (только для товаров с одним артикулом).<br>
— Виджеты графика продаж за последний месяц, текущих заказов и последних отзывов о товарах.<br>
— В разделе «Покупатели» добавлена удобная возможность перехода к отправке рассылки всем найденным покупателям (кнопка «Отправить рассылку»).<br>
— Обновленный алгоритм формирования названий файлов эскизов изображений, который сохраняет оригинальное название файлов изображения для всех созданных эскизов.<br>
— Шаблон сообщения для действия «Написать клиенту» (настраивается в разделе Настройки &gt; Статусы заказов &gt; Написать клиенту)
— Соцсети: возможность редактирования описаний Open Graph для страниц товаров, категорий, информационных страниц, главной страницы витрины магазина.<br>
— Отложенные SMS-уведомления.<br>
— Настройка списания товаров со склада, позволяющая выбрать, чем ограничено максимальное количество товаров, которое может быть заказано: остатком на основном складе витрины или суммой остатков на всех складах.<br>
— Множественные системные и интерфейсные улучшения.<br>
— Исправление найденных ошибок.";s:8:"datetime";s:19:"2015-07-28 04:47:26";}i:12;a:3:{s:7:"version";s:11:"6.0.3.38328";s:7:"content";s:975:"— Отчет о продажах: добавлена возможность экспорта данных графика в CSV.<br>
— Страна по умолчанию: в форме ввода контактной информации страна теперь определяется общей настройкой магазина, а не локалью браузера пользователя.<br>
— Исправлена ошибка массового назначения наклеек для всех выбранных товаров.<br>
— Upselling: незначительные улучшения в алгоритме подбора схожих товаров.<br>
— Исправлена ошибка копирования характеристик типа boolean при создании дубликата товара.<br>
— Незначительные улучшения пользовательского интерфейса.";s:8:"datetime";s:19:"2015-04-17 10:15:49";}i:13;a:3:{s:7:"version";s:11:"6.0.2.37778";s:7:"content";s:1238:"Реализован учет общей скидки на заказ при построении отчетов о продажах единичного товара: на профильной странице товара и в отчете «Бестселлеры» («размазывание» общей скидки по всем заказанным товарам для более точной оценки прибыльности товара).<br>
Исправлена фильтрация товаров в динамических категориях в случае включения товаров из соседних статических категорий (когда для родительской категории включена галочка «Показывать товары из подкатегорий»).<br>
Незначительные интерфейсные улучшения и исправление найденных ошибок: в отчетах о продажах, пересчет скидки при редактировании товара в бекенде, отображение скидки при использовании партнерского начисления.";s:8:"datetime";s:19:"2015-03-30 11:49:53";}i:14;a:3:{s:7:"version";s:11:"6.0.2.37749";s:7:"content";s:98:"Исправлена ошибка отображения фильтра «В обработке».";s:8:"datetime";s:19:"2015-03-27 10:54:33";}i:15;a:3:{s:7:"version";s:11:"6.0.2.37745";s:7:"content";s:473:"В отчете «Что продавать» добавлена настройка фильтрации товаров.<br>
Исправлен пересчет цен в основную валюту для рекомендуемых товаров и услуг, стоимость которых задана в процентах.<br>
Исправлена ошибка экспорта характеристик.<br>
Незначительные улучшения.";s:8:"datetime";s:19:"2015-03-27 10:08:22";}i:16;a:3:{s:7:"version";s:11:"6.0.2.37700";s:7:"content";s:678:"Исправлено создание новых профилей в импорте/экспорте.<br>
Исправлено создание категорий покупателей.<br>
Вернули чекбокс «Игнорировать принадлежность к категориям» в CSV-импорте.<br>
Исправлена проблема со статусами заказов (возникала на некоторых версиях PHP).<br>
Исправлено сохранение настроек округления.<br>
Исправлен пересчет отчетов при удалении затрат на маркетинг.";s:8:"datetime";s:19:"2015-03-26 11:55:24";}i:17;a:3:{s:7:"version";s:11:"6.0.2.37657";s:7:"content";s:832:"Исправлена работа подбора схожих товаров (upselling) для многомерных характеристик (Значение х Значение).<br>
Исправлено отображение Яндекс.Карт в версии заказа для печати.<br>
Исправлено отображение картинок товаров в списке для товаров, которые загружают через lazyloading (если картинку включить).<br>
Исправлено управление доступностью нового действия «Написать клиенту» в настройках статусов.<br>
Исправлено взаимодействие с плагинами скидок (описания скидок).";s:8:"datetime";s:19:"2015-03-25 13:05:54";}i:18;a:3:{s:7:"version";s:11:"6.0.2.37641";s:7:"content";s:463:"Исправлены найденные ошибки: ошибка при создании дубликатов товаров, ошибка валидации полей типа «день рождения» (birthday), ошибка сохранения динамических категорий-фильтров по тегу, исправлен расчет прибыли при заказе товара с дополнительными услугами.";s:8:"datetime";s:19:"2015-03-25 09:51:22";}i:19;a:3:{s:7:"version";s:11:"6.0.2.37625";s:7:"content";s:294:"Исправлена ошибка валидации обязательных для заполнения полей адреса.
Исправлена ошибка совместимости с плагинами замены Title и META-описаний товаров на витрине.";s:8:"datetime";s:19:"2015-03-25 06:03:10";}i:20;a:3:{s:7:"version";s:11:"6.0.2.37612";s:7:"content";s:4061:"<ul>
	<li>Полностью новый раздел «Отчеты»: отчеты о продажах и прибыли с детализацией по источниками трафика и UTM-кампаниям, метрики ROI, LTV, CAC, ARPU, AMPU, когортный анализ, складские активы, прогнозирование продаж, обновленная воронка оформления заказа.</li>
	<li>Мини-CRM: возможность поиска покупателей по заказам, способам оплаты и доставки, витрине, адресу и другим параметрам.</li>
	<li>Поддержка A/B-тестирования</li>
	<li>Улучшение интерфейса почти всех экранов бекенда (режима администратора), включая версию бекенда для мобильных устройств</li>
	<li>Оптимизация интерфейса бекенда для использования на планшетах</li>
	<li>Общее улучшение навигационной структуры в теме дизайна «Дефолт 2.0»</li>
	<li>Расширение системы прав доступа пользователей бекенда: новый уровень прав доступа на редактирование товаров без возможности их удаления, регулирование прав доступа по всем основным экранам бекенда</li>
	<li>Новые API-методы для работы с заказами</li>
	<li>Новые хелперы для получения списка складов, отзывов, значений характеристик списка товаров</li>
	<li>Создание дубликатов товаров</li>
	<li>Характеристика товаров «разделитель»</li>
	<li>Детализация скидок: подробная информация о способе расчета скидки добавляется в журнал обработки заказа</li>
	<li>Автоматическое округление стоимости товаров при пересчете из одной валюты в другую</li>
	<li>Автоматическое прикрепление заказов, оформленных неавторизованными пользователями, к уже зарегистрированным покупателям в случае совпадения email (настройка)</li>
	<li>Множественные улучшения алгоритма умного поиска товаров</li>
	<li>Возможность замены умного поиска упрощенной версией</li>
	<li>Полная поддержка Retina-дисплеев в бекенде</li>
	<li>Поддержка Яндекс.Карт</li>
	<li>Действие «Написать клиенту» на странице обработки заказа</li>
	<li>Оформление заказа: отдельная обработка ошибочных ситуаций (например, истекла сессия)</li>
	<li>Возможность добавления, удаления и настройки внешнего вида нестандартных кнопок действий с заказами</li>
	<li>Промо-карточки: возможность простой публикации спецпредложений и акций на главной странице магазина</li>
	<li>Возможность автоматической сортировки всего дерева категорий по алфавиту</li>
	<li>Экран подсказок по началу работы для новых пользователей</li>
	<li>Новая иконка приложения</li>
</ul>";s:8:"datetime";s:19:"2015-03-25 02:51:36";}i:21;a:3:{s:7:"version";s:11:"5.2.4.35330";s:7:"content";s:356:"— Добавлены хуки для плагинов image_thumb (создание эскизов изображений товаров ), cart_add (добавление товара в корзину), cart_delete (удаление товара из корзины).<br>
— Исправлены незначительные мелкие ошибки.";s:8:"datetime";s:19:"2014-12-03 08:14:26";}i:22;a:3:{s:7:"version";s:11:"5.2.4.35050";s:7:"content";s:495:"— @2x-спрайт иконок для Retina-дисплеев<br>
— Улучшено отображение пользовательского интерфейса бекенда на iPad и других планшетах<br>
— Оптимизирована скорость загрузки формы сохранения товаров для случая большого количества категорий<br>
— Прочие незначительные улучшения";s:8:"datetime";s:19:"2014-11-26 09:55:59";}i:23;a:3:{s:7:"version";s:11:"5.2.4.34970";s:7:"content";s:364:"Совместимость с обновлением фреймворка Webasyst 1.3.0:<br>
— обновленный улучшенный пользовательский интерфейс бекенда приложения,<br>
— общие улучшения и исправление недочетов в теме дизайна «Дефолт 2.0».";s:8:"datetime";s:19:"2014-11-25 07:36:36";}i:24;a:3:{s:7:"version";s:11:"5.2.3.33159";s:7:"content";s:580:"Улучшение системы кеширования, оптимизация скорости генерации главной страницы фронтенда (витрины интернет-магазина).<br>
Регистрация основных действий пользователей бекенда и покупателей интернет-магазина в журнале «<a href="http://www.webasyst.ru/store/plugin/contacts/pro/" target="_blank">Контактов PRO</a>».<br>
Исправление незначительных ошибок.";s:8:"datetime";s:19:"2014-09-18 09:33:39";}i:25;a:3:{s:7:"version";s:11:"5.2.3.32659";s:7:"content";s:724:"<p>Поддержка совместимости с обновлением фреймворка Webasyst до версии 1.2.3:</p>
<ul>
    <li>Обновленная тема дизайна «Дефолт 2.0»: новый внешний вид и улучшения в процедуре оформления заказа, оптимизация верстки, разметки Schema.org и структуры темы.</li>
    <li>Настройка часов работы магазина для отображения на витрине (требуется поддержка отображения темой дизайна).</li>
    <li>Исправление найденных ошибок.</li>
</ul>";s:8:"datetime";s:19:"2014-09-02 07:41:01";}i:26;a:3:{s:7:"version";s:11:"5.2.2.30933";s:7:"content";s:773:"<ul>
<li>Улучшения в теме дизайна «Дефолт» 2.0:<br>
— Новый интерфейс выбора значений характеристик для товаров в режиме продажи «Выбор характеристик» (альтернатива выбору с помощью &lt;select&gt;).<br>
— Множественные улучшения отображения витрины магазина в разных браузерах, исправление найденных ошибок.</li>
<li>Новые хуки: backend_customer, backend_order.aux_info, backend_settings_affiliate, frontend_my_affiliate.</li>
<li>Незначительные улучшения работы приложения.</li>
</ul>";s:8:"datetime";s:19:"2014-06-03 07:14:16";}i:27;a:3:{s:7:"version";s:11:"5.2.2.29979";s:7:"content";s:383:"— Исправлены ошибки в теме дизайна Default 2.0.<br>
— Исправлены мелкие ошибки в функции редактирования заказов.<br>
— Исправлены ошибки в функции импорта товаров из CSV-файла.<br>
— Мелкие улучшения в работе магазина.";s:8:"datetime";s:19:"2014-04-30 10:42:29";}i:28;a:3:{s:7:"version";s:11:"5.2.2.29954";s:7:"content";s:76:"Исправление различных ошибок и недочётов";s:8:"datetime";s:19:"2014-04-28 10:36:05";}i:29;a:3:{s:7:"version";s:11:"5.2.2.29912";s:7:"content";s:285:"Исправлены некоторые ошибки работы WYSIWIG-редактора, которые проявлялись при работе в ОС Windows.<br>
Исправлены незначительные ошибки в теме дизайна «Дефолт» 2.0.";s:8:"datetime";s:19:"2014-04-25 09:51:27";}i:30;a:3:{s:7:"version";s:11:"5.2.2.29887";s:7:"content";s:35:"Исправление ошибок";s:8:"datetime";s:19:"2014-04-24 16:08:02";}i:31;a:3:{s:7:"version";s:11:"5.2.2.29878";s:7:"content";s:1837:"<ul>
    <li>Новая базовая тема дизайна «Дефолт» 2.0.</li>
    <li>Полностью обновленный импорт товаров из CSV-файлов: новый интерфейс, поддержка импорта товаров в режиме выбора характеристик &lt;{}&gt;, множественные улучшения и исправление ошибок.</li>
    <li>Новый визуальный редактор на базе Redactor.</li>
    <li>@2x: Поддержка автоматического создания эскизов изображений товаров для дисплеев с высокой плотностью пикселей (например, Retina). Работает во всех базовых темах дизайна.</li>
    <li>Фильтрация товаров во фронтенде по значениям числовых характеристик и характеристик типа диапазон.</li>
    <li>Фильтрация товаров теперь отображает цену на товар и по умолчанию выбирает артикул товара, основываясь на параметрах фильтрации, которые задал пользователь.</li>
    <li>В режиме редактирования заказа добавлен автоматический пересчет скидки.</li>
    <li>Новые хуки backend_order_edit, backend_order.info_section.</li>
    <li>Исправлена ошибка визуализации отчета воронки оформления заказов.</li>
    <li>Множественные улучшения и исправление найденных ошибок.</li>
</ul>";s:8:"datetime";s:19:"2014-04-24 07:51:29";}i:32;a:3:{s:7:"version";s:11:"5.2.1.28368";s:7:"content";s:2028:"<ul>
    <li>Добавлен отчет «Воронка оформления заказа», отображающий информацию о том, сколько покупателей успешно довели оформление заказа до конца и сколько бросили покупку в процесса оформления и на каком шаге. Данные, на основе которых строится воронка, начали собираться с момент установки Shop-Script версии 5.2.0 (декабрь 2013).</li>
    <li>Для динамических категорий добавлена возможность фильтрации товаров по значениям характеристик.</li>
    <li>Добавлена возможность переопределения веса на уровне артикула товара.</li>
    <li>Title и META-теги товаров: в значении этих параметров товаров добавлена поддержка использования переменных {$name}, {$summary}, {$price}.</li>
    <li>Реализовано ведение журнала остатков товаров в случае отсутствия складов (ранее журнал пополнялся только при работе с несколькими складами).</li>
    <li>Добавлена настройка поселения (витрины), позволяющая принудительно включить HTTPS-соединение для оформления заказа (/checkout/) и личного кабинета покупателя (/my/). Защищенное соединение требует наличие SSL-сертификата и позволяет обезопасить ввод данных при оформлении заказа.</li>
    <li>Исправлены найденные ошибки.</li>
</ul>";s:8:"datetime";s:19:"2014-02-14 08:51:22";}i:33;a:3:{s:7:"version";s:11:"5.2.0.27913";s:7:"content";s:453:"— Исправлена ошибка сохранения остатка товаров на складе в случае бесконечного (неопределенного) остатка,<br>
— Исправлена ошибка установки голубого цвета для характеристик типа «Цвет»,<br>
— Прочие улучшения и исправления незначительных ошибок.";s:8:"datetime";s:19:"2014-01-24 04:35:50";}i:34;a:3:{s:7:"version";s:11:"5.2.0.27872";s:7:"content";s:314:"<ul>
  <li>Исправлена ошибка копирования описаний при редактировании товаров.</li>
  <li>Исправлена ошибка фильтрации товаров в категориях по цене при выборе разных валют.</li>
</ul>";s:8:"datetime";s:19:"2014-01-16 08:23:04";}i:35;a:3:{s:7:"version";s:11:"5.2.0.27812";s:7:"content";s:87:"Незначительные улучшения и исправление ошибок.";s:8:"datetime";s:19:"2013-12-27 05:52:48";}i:36;a:3:{s:7:"version";s:11:"5.2.0.27755";s:7:"content";s:261:"Улучшен интерфейс диалога получения кода для вставки списка товаров и исправлена ошибка сохранения информации об остатках на многих складах.";s:8:"datetime";s:19:"2013-12-25 11:10:33";}i:37;a:3:{s:7:"version";s:11:"5.2.0.27730";s:7:"content";s:169:"— Незначительные улучшения пользовательского интерфейса.
— Исправление найденных ошибок.";s:8:"datetime";s:19:"2013-12-25 06:28:39";}i:38;a:3:{s:7:"version";s:11:"5.2.0.27631";s:7:"content";s:497:"Исправление найденных ошибок и незначительные улучшения:<br>— улучшение системы конвертации типов характеристик<br>— улучшение системы списания товаров со склада<br>— доработана система сохранения адреса плательщика (billing address)<br>— незначительные интерфейсные улучшения";s:8:"datetime";s:19:"2013-12-23 09:52:58";}i:39;a:3:{s:7:"version";s:11:"5.2.0.27578";s:7:"content";s:245:"Исправлена ошибка поиска заказа по номеру.<br>
Исправлена ошибка отображения характеристик.<br>
Прочие мелкие исправления и улучшения.";s:8:"datetime";s:19:"2013-12-20 10:18:25";}i:40;a:3:{s:7:"version";s:11:"5.2.0.27573";s:7:"content";s:76:"Обновлен файл описания темы дизайна theme.xml";s:8:"datetime";s:19:"2013-12-20 06:47:33";}i:41;a:3:{s:7:"version";s:11:"5.2.0.27566";s:7:"content";s:5170:"<p>Новые возможности:</p><ul>  <li>поиск заказов в бекенде по имени клиента, электронному адресу, номеру телефона, названиям товаров</li>  <li>возможность сортировки характеристик товаров в фильтрах категорий</li>  <li>указание стоимости услуг в процентах от стоимости товаров</li>  <li>настройка поиска товаров по различным параметрам и возможность принудительного обновления поискового индекса</li>  <li>массовое применение действий к заказам в режиме просмотра заказов таблицей</li>  <li>фильтр заказов по витринам (при наличии более чем одной витрины)</li>  <li>журнал изменений складских остатков по каждому товару (работает только при настроенных складах; информация об изменении остатков будет сохраняться в журнале только начиная с момента установки данного обновления)</li>  <li>возможность указания отправителя для каждого уведомления (email и SMS), отправляемого интернет-магазином</li>  <li>редактирование HTML/Smarty-шаблонов печатных форм счета-фактуры и товарной накладной</li>  <li>отображение на странице товара информации о приблизительных сроках исчерпания остатков на складе при сохранении текущих темпов продаж</li>  <li>знак рубля вместо «руб.» (только в базовых версиях тем дизайна)</li>  <li>возможность настройки отдельных элементов оформления тем дизайна в браузере: цвета панели навигации, ссылок и т. п. (только в базовых версиях тем дизайна)</li>  <li>параметр «AJAX-фильтр», при включении которого подбор товаров выполняется без перезагрузки страницы (только в базовых версиях тем дизайна)</li>  <li>настройка витрины (поселения), позволяющая автоматически перемещать вниз списков товары, которых нет в наличии</li>  <li>добавление товаров в корзину из списка товаров теперь открывает диалог выбора артикула в случае, если у товара есть несколько артикулов на выбор (только в базовых версиях тем дизайна)</li>  <li>автоматическое разбиение файла Sitemap на несколько частей при превышении количества товаров 10 000 шт.</li>  <li>тег с атрибутом rel=&quot;canonical&quot; для страниц категорий (только в базовых версиях темах дизайна)</li>  <li>возможность перегенерации эскизов изображений всех товаров</li>  <li>новые типы характеристик товаров «Цвет»</li>  <li>просмотр списка заказов покупателя в приложении «Контакты»</li>  <li>функция слияния контактов покупателей (в приложении «Контакты») с объединением их истории заказов и прочих данных</li>  <li>установка плагинов непосредственно из бекенда интернет-магазина</li>  <li>функция изменения типа данных для характеристик товаров</li>  <li>форматированное отображение телефонных номеров</li>  <li>новые хуки frontend_my_nav, frontend_checkout</li>  <li>множественные улучшения пользовательского интерфейса</li>    <li>оптимизация скорости работы</li></ul><p>Исправление недочетов и найденных ошибок:</p><ul>  <li>импорт товаров из CSV-файла</li>  <li>более точный расчет прибыли с учетом даты фиксации закупочной стоимости в момент отгрузки заказа</li>  <li>различные незначительные ошибки</li></ul>";s:8:"datetime";s:19:"2013-12-20 04:52:29";}i:42;a:3:{s:7:"version";s:11:"5.1.9.26237";s:7:"content";s:232:"Исправление ошибки вывода информационных страниц продукта (ошибка наблюдалась при включении одного из правил маршрутизации).";s:8:"datetime";s:19:"2013-10-30 09:52:06";}i:43;a:3:{s:7:"version";s:11:"5.1.9.26199";s:7:"content";s:382:"<ul>
<li>Добавлена настройка качества сохранения эскизов изображений товаров (качество сжатия JPEG)</li>
<li>Улучшена общая производительность работы интернет-магазина</li>
<li>Исправлены незначительные ошибки</li>
</ul>";s:8:"datetime";s:19:"2013-10-25 10:04:13";}i:44;a:3:{s:7:"version";s:11:"5.1.9.25102";s:7:"content";s:96:"Различные улучшения и исправления найденных ошибок.";s:8:"datetime";s:19:"2013-09-18 04:38:39";}i:45;a:3:{s:7:"version";s:11:"5.1.9.24470";s:7:"content";s:85:"Исправлена ошибка в работе отчетов о продажах.";s:8:"datetime";s:19:"2013-08-30 08:37:00";}i:46;a:3:{s:7:"version";s:11:"5.1.9.24400";s:7:"content";s:1165:"<ul>
  <li>В настройки полей контактной информации добавлена возможность создания пользовательских полей типа «Флажок» (checkbox).</li>
  <li>Добавлен запрет на кеширование содержимого страницы корзины.</li>
  <li>Исправлены ошибки, возникавшие при сохранении характеристик товаров.</li>
  <li>Исправлена ошибка формирования печатной формы платежного документа при попытке доступа к ней неавторизованным покупателем с использованием PIN-кода.</li>
  <li>Исправлены ошибки в работе отчета о продажах.</li>
  <li>Исправлена работа метода <code>$wa->shop->categories()</code>.</li>
  <li>Исправлено ошибочное добавление подкатегорий скрытой родительской категории в файл Sitemap.</li>
</ul>";s:8:"datetime";s:19:"2013-08-29 07:20:00";}i:47;a:3:{s:7:"version";s:11:"5.1.9.23952";s:7:"content";s:601:"<ul>
<li>Исправлена работа функции <code>{$wa->shop->categories()}</code>.</li>
<li>Исправлена обработка хука <code>backend_settings_discounts</code>.</li>
<li>Исправлена ошибка импорта категорий товаров из CSV-файла, приводившая к появлению дублей категорий .</li>
<li>Исправлено отображение зачеркнутой цены на витрине, если она меньше или равна основной цене артикула.</li>
</ul>";s:8:"datetime";s:19:"2013-08-05 09:35:00";}i:48;a:3:{s:7:"version";s:11:"5.1.9.23928";s:7:"content";s:312:"<ul>
<li>Исправлена обработка ответа от платежных систем.</li>
<li>Исправлена ошибка получения списка способов доставки при создании и редактировании заказа в бекенде.</li>
</ul>
";s:8:"datetime";s:19:"2013-08-02 10:09:00";}i:49;a:3:{s:7:"version";s:11:"5.1.9.23918";s:7:"content";s:959:"<ul>
<li>Реализовано применение параметра «Включить товары из подкатегорий» при просмотре категорий товаров в бекенде.</li>
<li>Добавлена возможность изменения ширины левой боковой панели в разделе «Товары».</li>
<li>Улучшен интерфейс настройки категорий товаров.</li>
<li>Исправлена ошибка отображения на витрине подкатегорий, вложенных в скрытую родительскую категорию.</li>
<li>Добавлены новые хуки, включая <code>backend_settings_discounts</code> и <code>order_calculate_discount</code> — для создания плагинов расчета скидок.</li>
<li>Исправление мелких ошибок.</li>
</ul>";s:8:"datetime";s:19:"2013-08-02 08:26:00";}i:50;a:3:{s:7:"version";s:11:"5.1.9.23733";s:7:"content";s:236:"<ul>
<li>Исправление ошибок</li>
<li>В настройках рекомендуемых товаров добавлена возможность указывать условие на тип товаров</li>
</ul>";s:8:"datetime";s:19:"2013-07-24 13:08:00";}i:51;a:3:{s:7:"version";s:11:"5.1.9.23717";s:7:"content";s:1007:"<ul>
<li>Добавлена возможность отображения категорий товаров на любых выбранных витринах.</li>
<li>Добавлено автоматическое перенаправление покупателя на сайт платежной системы для оплаты заказа.</li>
<li>Добавлены новые хуки для разработки плагинов: order_calculate_discount, category_save, category_delete, backend_category_dialog, backend_products, а также хуки для действий с заказами: order_action.create, order_action.pay и т. п.</li>
<li>Исправлена ошибка редактирования заказов с товарами, отсутствующими на складе.</li>
<li>Исправлены недочеты импорта товаров из CSV-файла.</li>
<li>Исправление других мелких ошибок.</li>
</ul>";s:8:"datetime";s:19:"2013-07-24 05:43:00";}i:52;a:3:{s:7:"version";s:11:"5.1.9.23604";s:7:"content";s:1982:"<ul>
<li>Добавлены новые типы многомерных характеристик товаров: «Значение х Значение» и «Значение х Значение х Значение» (для указания размера экрана или габаритов упаковки и других подобных параметров).</li>
<li>Доработан механизм обработки обратных вызовов от платежных систем: теперь они фиксируются в логе обработки заказа</li>
<li>Для разработчиков: в дополнение к методу callbackPaymentHandler() модулей оплаты добавлены методы для действий Cancel, Auth, Capture, Refund, Decline, Chargeback.</li>
<li>Для разработчиков: добавлена возможность выборки списков товаров по значениям характеристик (пример хеша для формирования коллекции: <code>search/brand=Samsung</code>).</li>
<li>Исправлена печать форм №113 и №116 в Internet Explorer 9.</li>
<li>Исправлены ошибки отображения товаров во вложенных динамических категориях.</li>
<li>Исправлена отображение списка подкатегорий на странице родительской категории на разных витринах.</li>
<li>Исправлено некорректное отображение личного кабинета покупателя в нескольких темах дизайна.</li>
<li>Исправлена печать заказов с большим списком товаров в браузерах Firefox и Opera.</li>
<li>Исправление других недочетов.</li>
</ul>";s:8:"datetime";s:19:"2013-07-18 06:17:00";}i:53;a:3:{s:7:"version";s:11:"5.1.9.23480";s:7:"content";s:416:"<ul>
<li>Добавлен новый тип характеристик товаров «диапазон».</li>
<li>Исправлены ошибки в разделе управления характеристиками товаров.</li>
<li>Исправлены ошибки в работе модуля оплаты WorldPay.</li>
<li>Исправление мелких недочетов.</li>
</ul>
";s:8:"datetime";s:19:"2013-07-09 06:44:00";}i:54;a:3:{s:7:"version";s:11:"5.1.9.23418";s:7:"content";s:137:"Оптимизация запросов, исправление незначительных ошибок, общие улучшения.";s:8:"datetime";s:19:"2013-07-03 09:41:00";}i:55;a:3:{s:7:"version";s:11:"5.1.9.23391";s:7:"content";s:74:"Незначительные исправления и улучшения.";s:8:"datetime";s:19:"2013-07-02 04:38:00";}i:56;a:3:{s:7:"version";s:11:"5.1.9.23377";s:7:"content";s:1254:"— Интеграция с соцсетями «ВКонтакте» и Facebook: темы дизайна, адаптированные для встраивания витрины магазина в соцсеть в виде iframe-приложений, автоматическая авторизация пользователя соцсети в магазине (темы дизайна устанавливаются через Инсталлер; см. инструкцию на сайте Shop-Script)<br>
— Оптимизация экрана управления типами товаров и характеристик, позволяющие более удобно работать с очень большими количествами типов товаров, характеристик и их значений<br>
— Новый тип характеристики «Да/нет-переключатель (boolean)»<br>
— Модуль USPS: трекинг посылок в реальном времени и печатные формы<br>
— Модуль оплаты WorldPay<br>
— Несколько новых методов API Shop-Script для работы с характеристиками товаров";s:8:"datetime";s:19:"2013-07-01 10:53:00";}i:57;a:3:{s:7:"version";s:11:"5.1.8.23275";s:7:"content";s:477:"Исправления ошибок, возникавших в некоторых конфигурациях интернет-магазина:<br>
— ошибки сортировки товаров внутри категорий<br>
— ошибки отображения информации об остатках на складе для артикула по умолчанию<br>
— небольшие дополнения в отдельных методах API";s:8:"datetime";s:19:"2013-06-26 07:25:00";}i:58;a:3:{s:7:"version";s:11:"5.1.8.23222";s:7:"content";s:693:"— API для работы с товарами и категориями<br />
— Общие улучшения в работе: автоматическая фильтрация списка вариантов характеристик во фронтенд-фильтре товаров внутри категорий в зависимости от содержимого категорий, AJAX-дерево категорий в бекенде для работы с очень большими деревьями (ранее загружалось все дерево сразу), множественные улучшения, исправления найденных ошибок";s:8:"datetime";s:19:"2013-06-24 08:37:00";}i:59;a:3:{s:7:"version";s:11:"5.1.7.23050";s:7:"content";s:315:"<p>Доступны для установки новые модули интеграции с сервисами расчета доставки и оплаты:</p>
<ul>
<li>Authorize.Net SIM</li>
<li>FedEx</li>
<li>UPS</li>
<li>USPS</li>
</ul>
<p>Исправление мелких недочетов.</p>";s:8:"datetime";s:19:"2013-06-07 05:07:00";}i:60;a:3:{s:7:"version";s:11:"5.1.7.22987";s:7:"content";s:159:"Незначительные изменения в CSS тем дизайна для улучшения отображения на iPad и в Internet Explorer";s:8:"datetime";s:19:"2013-05-31 07:17:00";}i:61;a:3:{s:7:"version";s:11:"5.1.7.22954";s:7:"content";s:930:"<ul>
<li>Добавлены 3 новых темы дизайна: Clear, Sidebar, Nifty</li>
<li>Добавлено отображение адресов обратных вызовов для платежных систем (callback URL) в настройках соответствующих модулей оплаты</li>
<li>Улучшена обработка обратных вызовов от платежных систем и смены статуса заказа в зависимости от ответа платежной систем ы</li>
<li>Улучшена обработка наличия на складе и доступности для заказа добавленных в корзину товаров</li>
<li>Добавлен хук backend_order</li>
<li>Оптимизация системных функций, исправление обнаруженных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-05-30 11:24:00";}i:62;a:3:{s:7:"version";s:11:"5.1.6.22769";s:7:"content";s:1730:"<ul>
<li>Поддержка возможности обмена данными с «1С: Управление торговлей» версии 11</li>
<li>Модуль приема платежей через «<a href="http://privat24.ua" target="_blank">Приват24</a>»</li>
<li>Оформление заказов: 1) Улучшения в интерфейсе настройки формы ввода контактной информации, 2) Поле «Список (radio)»: возможность скрывать отдельные поля формы при определенных выбранных значениях, 3) Возможность отключать проверку заполнения полей контактной информации при оформлении заказа в бекенде (администратором магазина), 4) Согласие с Условиями предоставление услуг магазина.</li>
<li>Улучшения в шаблонах тем дизайна «Дефолт» и CUSTOM: 1) Незначительные улучшения в CSS и исправления ошибок работы в браузере Internet Explorer, 2) Шаблоны дизайна оформления заказа checkout.*.html: изменения, направленные на улучшение процесса оформления заказа, обработки ошибочных ситуаций и т.п.</li>
<li>Исправление ошибок, множественные улучшения, направленные на повышение общей стабильности работы продукта.</li>
</ul>";s:8:"datetime";s:19:"2013-05-23 09:12:00";}i:63;a:3:{s:7:"version";s:11:"5.1.5.22480";s:7:"content";s:396:"<ul>
<li>Исправлена ошибка оформления заказа в браузере Internet Explorer 9 при использовании темы дизайна «CUSTOM».</li>
<li>Исправлена ошибка добавления товаров в корзину при включенном режиме продажи «Выбор характеристик».</li>
</ul>";s:8:"datetime";s:19:"2013-05-06 09:54:00";}i:64;a:3:{s:7:"version";s:11:"5.1.5.22467";s:7:"content";s:1937:"<ul>
<li>добавлена функция обмена данными с «1С: Управление торговлей»</li>
<li>добавлена поддержка транзакций Google Analytics</li>
<li>добавлен плагин для наложения водяных знаков на загружаемые изображения товаров</li>
<li>добавлен плагин доставки «Самовывоз»</li>
<li>добавлены плагины для приема платежей через системы RBK Money и ASSIST</li>
<li>добавлена возможность редактирования комментария к заказу</li>
<li>добавлено поле для ввода дополнительных параметров страницы товара</li>
<li>в темах дизайна «Дефолт» и CUSTOM оформление витрины для стационарных и мобильных устройств изменяется в зависимости от ширины окна браузера</li>
<li>добавлена возможность настройки полного и неполного полей адреса, запрашиваемых в шаге выбора способа доставки, если адрес покупателя еще не указан</li>
<li>доработан интерфейс редактирования полей адреса в настройке оформления заказов</li>
<li>в шпаргалке редактора дизайна добавлены описания новых хелперов для получения данных</li>
<li>улучшена фильтрация результатов поиска товаров</li>
<li>незначительные улучшения и исправления найденных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-04-30 08:16:00";}i:65;a:3:{s:7:"version";s:11:"5.1.4.22205";s:7:"content";s:2090:"<ul>
<li>Добавлена функция пакетной загрузки изображений с возможностью массового создания новых товаров  и присвоения загруженных изображений существующим товарам (см. раздел «Импорт/экспорт»).</li>
<li>Добавлена возможность загрузки изображений при импорте товаров из CSV-файла.</li>
<li>Улучшено соответствие тем дизайна требованиям W3C к валидации HTML-документов.</li>
<li>В теме дизайна CUSTOM добавлена возможность оформления заказа на одной странице (AJAX-чекаут).</li>
<li>Для модулей доставки добавлена функция запроса необходимых полей адреса покупателя, обязательных для работы данного модуля.</li>
<li>Добавлена возможность выбора способов доставки, доступных для каждого настроенного способа оплаты.</li>
<li>Добавлена возможность скрыть отдельные способы доставки, способы оплаты и категории товаров на данной витрине.</li>
<li>В диалоге редактирования свойств категорий товаров добавлен WYSIWYG/HTML-редактор.</li>
<li>Для модуля доставки «Курьер» добавлена печатная форма «Лист доставки».</li>
<li>В поле редактирования текстов уведомлений и отложенных сообщений добавлен список доступных переменных.</li>
<li>Исправления ошибок и незначительные улучшения.</li>
</ul>";s:8:"datetime";s:19:"2013-04-19 03:51:00";}i:66;a:3:{s:7:"version";s:11:"5.1.3.21833";s:7:"content";s:784:"<ul>
<li>Исправлены ошибки импорта и экспорта тегов и множественных значений характеристик товаров и другие ошибки, возникавшие при импорте CSV-файла.</li>
<li>Исправлены ошибки верстки в браузере Safari.</li>
<li>Исправлена ошибка добавления товара в корзину при использовании темы дизайна «ДЕФОЛТ» и режима продажи товаров с выбором характеристик.</li>
<li>Добавлен учет скидки при расчете налогов.</li>
<li>Уменьшено потребление памяти.</li>
</ul>";s:8:"datetime";s:19:"2013-04-09 10:13:00";}i:67;a:3:{s:7:"version";s:11:"5.1.3.21776";s:7:"content";s:597:"<ul><li>Добавлена функция экспорта товаров в CSV-файл.</li>
<li>Добавлен режим автоматического создания артикулов товара на основании выбранных сочетаний дополнительных характеристик.</li>
<li>В настройках динамических категорий  добавлен фильтр по цене товаров.</li>
<li>Улучшения в темах витрины.</li>
<li>Исправления мелких ошибок.</li>
</ul>";s:8:"datetime";s:19:"2013-04-05 05:43:00";}i:68;a:3:{s:7:"version";s:11:"5.1.2.21608";s:7:"content";s:108:"Исправлена ошибка расчета суммы НДС при оформлении заказа.";s:8:"datetime";s:19:"2013-03-29 12:25:00";}i:69;a:3:{s:7:"version";s:11:"5.1.2.21605";s:7:"content";s:1652:"<ul>
  <li>Добавлен плагин расчета стоимости и времени доставки «EMS Почта России» через API сервиса (http://www.emspost.ru/).</li>
  <li>Добавлены плагины интеграции с платежными системами Liqpay и Интеркасса.</li>
  <li>Улучшения интерфейса управления товарами: добавление и удаление товаров из категорий и списков с помощью пунктов в правом вертикальном меню, массовое присвоение тегов выбранным товарам.</li>
  <li>Добавлена версия страницы заказа, адаптированная для печати (доступна по ссылке «Печать»).</li>
  <li>Добавлена возможность авторизации зарегистрированного покупателя во время оформления заказа (в виде переключателя на странице ввода контактной информации).</li>
  <li>Добавлена возможность переключать вид отображения дерева категорий в шаблоне темы оформления: полностью раскрыты все категории либо раскрыта только выбранная часть дерева.</li>
  <li>Улучшения интерфейса бекенда, исправления недочетов и ошибок.</li>
</ul>";s:8:"datetime";s:19:"2013-03-29 10:56:00";}i:70;a:3:{s:7:"version";s:11:"1.0.0.21449";s:7:"content";s:923:"<ul>
<li>Добавлена возможность импорта товаров из CSV-файла</li>
<li>Добавлена возможность отправки SMS-уведомлений о действиях с заказами; сообщения отправляются средствами плагинов, устанавливаемых через «Инсталлер»</li>
<li>Добавлен плагин отправки SMS-сообщений через sms.ru</li>
<li>Добавлена возможность скрывать товары и категории для показа на витрине магазина</li>
<li>Добавлены новые хуки для подключения плагинов на витрине: frontend_category и frontend_search</li>
<li>Многочисленные улучшения и исправления мелких ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-03-26 10:15:00";}i:71;a:3:{s:7:"version";s:11:"1.0.0.21252";s:7:"content";s:869:"
<ul>
<li>Отчеты: возможность просмотра данных за все время и за произвольно выбранный интервал времени</li>
<li>Импорт из WebAsyst Shop-Script: импорт купонов на скидку и артикулов товаров</li>
<li>Отзывы о товарах: в общих настройках магазина появилась возможность закрыть форму добавления отзыва капчей и отключить возможность публикации отзывов для неавторизованных пользователей</li>
<li>Незначительные исправления в печатных формах для заказов</li>
<li>Исправления найденных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-03-19 11:51:00";}i:72;a:3:{s:7:"version";s:11:"1.0.0.21191";s:7:"content";s:77:"Исправления найденных ошибок и недочетов.";s:8:"datetime";s:19:"2013-03-18 06:02:00";}i:73;a:3:{s:7:"version";s:11:"1.0.0.21184";s:7:"content";s:220:"<ul>
<li>Выбор дефолтной схемы для Gravatar-юзерпиков</li>
<li>Исправлены некоторые ошибки работы приложения в браузере Opera</li>
</ul>";s:8:"datetime";s:19:"2013-03-15 09:38:00";}i:74;a:3:{s:7:"version";s:11:"1.0.0.21174";s:7:"content";s:133:"<ul>
<li>Поддержка Gravatar-юзерпиков</li>
<li>Исправления найденных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-03-15 07:27:00";}i:75;a:3:{s:7:"version";s:11:"1.0.0.21154";s:7:"content";s:866:"<ul>
<li>Оптимизация скорости работы витрины</li>
<li>На странице ввода контактной информации при оформлении заказа добавлены возможность зарегистрироваться и отображение информации о текущем сеансе для авторизованных покупателей</li>
<li>Улучшена разметка страницы контакта в соответствии со стандартами микроформатов Schema.org</li>
<li>Мелкие улучшения верстки шаблонов печатных форм: счет-фактура, накладная, бланки Почты России №113, №116</li>
<li>Исправления найденных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-03-14 12:32:00";}i:76;a:3:{s:7:"version";s:11:"1.0.0.21119";s:7:"content";s:903:"<ul>
<li>Фильтр списка заказов «В обработке», который показывает заказы в статусах «Новый», «Подтвержден» и «Оплачен»</li>
<li>Счетчик новых заказов на основной иконке приложения</li>
<li>Плагин импорта данных из WebAsyst Shop-Script: настройка «Сохранять ID», при включении которой идентификаторы товаров и категорий при импорте будут гарантированно сохранены (необходимо для правильной настройки редиректа, если ранее использовался формат адресов вида index.php?productID=#)</li>
<li>Исправления найденных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-03-13 12:27:00";}i:77;a:3:{s:7:"version";s:11:"1.0.0.21080";s:7:"content";s:281:"Поиск товаров по артикулу.<br>
Добавлена кнопка "В корзину" в списках товаров.<br>
Исправлены ошибки в отчётах.<br>
Исправлен плагин экспорта в Яндекс.Маркет.";s:8:"datetime";s:19:"2013-03-12 13:07:00";}i:78;a:3:{s:7:"version";s:11:"1.0.0.21041";s:7:"content";s:2696:"<ul>
    <li>Улучшен интерфейс обработки заказов.</li>
    <li>Добавлена отдельная версия страницы просмотра одного заказа вместе со списком заказов, адаптированная для мобильных устройств с сенсорным экраном.</li>
    <li>В настройки складов добавлен выбор действия, выполнение которого приводит к заказанных единиц товара.</li>
    <li>Добавлены новые отчеты: продажи, прибыль, популярные товары.</li>
    <li>Добавлено автоматическое формирование файла Sitemaps для витрины.</li>
    <li>В режиме редактирования заказа добавлена возможность выбора склада, с которого следует выполнить списание.</li>
    <li>Добавлена возможность загрузить файл для каждой вариации товара, который покупатель сможет скачать после оплаты заказа (продажа электронных товаров).</li>
    <li>Добавлены новые плагины формирования печатных форм для Shop-Script 5: накладная, счет-фактура (устанавливаются через «Инсталлер»).</li>
    <li>В модуль расчета стоимости доставки Почтой России добавлены печатные формы №113 и №116.</li>
    <li>Добавлен плагин «Бренды» для фильтрации товаров по брендам на витрине. Может использоваться в качестве примера написания собственного плагина для Shop-Script 5.</li>
    <li>Добавлен плагин «301 redirect», выполняющий перенаправление трафика со старых адресов страниц витрины WebAsyst Shop-Script (обычных и ЧПУ) на адреса страниц витрины Shop-Script 5. Плагин предназначен для удобного перехода с WebAsyst Shop-Script на Shop-Script 5.</li>
    <li>Улучшен механизм импорта данных из WebAsyst Shop-Script в плагине «Переход на Shop-Script».</li>
    <li>Исправления ошибок.</li>
</ul>";s:8:"datetime";s:19:"2013-03-12 05:00:00";}i:79;a:3:{s:7:"version";s:11:"1.0.0.20686";s:7:"content";s:1569:"— Партнерская программа: начисление бонусов покупателям за собственные заказы, получение скидки за счет использования бонусов.<br>
— Фоллоу-апы: функция отправки email-уведомлений (например, рекламного характера) через определенный промежуток времени после оплаты заказа.<br>
— Добавлены хуки для подключения плагинов к основным разделам бекенда магазина.<br>
— Добавлена возможность выбора параметра сортировки товаров в списках на витрине магазина.<br>
— Отображение информации о складских остатках товара на витрине.<br>
— Добавлены модули оплаты по квитанции для физлиц и по счету для юрлиц (устанавливаются через «Инсталлер»).<br>
— Экспорт в Яндекс.Маркет (плагин устанавливается через «Инсталлер»).<br>
— В теме CUSTOM добавлено отображение списка специальных предложений в виде слайдера (на основе jQuery bxSlider).<br>
— Исправление ошибок и оптимизация кода.<br>";s:8:"datetime";s:19:"2013-03-07 09:10:00";}i:80;a:3:{s:7:"version";s:11:"1.0.0.20674";s:7:"content";s:649:"<ul>
<li>Улучшения в дефолтной теме дизайна: личный кабинет покупателя, CSS для мобильных устройств, JS-корзина</li>
<li>Тема дизайна CUSTOM для Shop-Script (устанавливается через Инсталлер)</li>
<li>Модули оплаты: Яндекс.Деньги, Робокасса, PayOnline System, Assist (устанавливаются через Инсталлер)</li>
<li>Повышена общая стабильность работы продукта, исправление найденных ошибок</li>
</ul>";s:8:"datetime";s:19:"2013-03-01 10:11:00";}i:81;a:3:{s:7:"version";s:11:"1.0.0.20555";s:7:"content";s:283:"Добавлены новые виды скидок: <ul> <li>процент от суммы текущего заказа;</li> <li>процент от общей суммы всех заказов покупателя.</li> </ul> Исправлены мелкие недочёты.";s:8:"datetime";s:19:"2013-02-27 07:58:00";}i:82;a:3:{s:7:"version";s:11:"1.0.0.20452";s:7:"content";s:598:"Обновлена тема дизайна «ДЕФОЛТ»:
<ul>
<li>добавлены новые хуки для подключения плагинов;</li>
<li>улучшена вёрстка для соответствия схемам Schema.org;</li>
<li>исправлены мелкие ошибки и сделаны визуальные улучшения.</li>
</ul>
Добавлено текстовое поле для сохранения комментариев к купонам на скидку.<br>
Исправлены ошибки в бекенде магазина.";s:8:"datetime";s:19:"2013-02-27 03:38:00";}i:83;a:3:{s:7:"version";s:11:"1.0.0.20151";s:7:"content";s:2174:"<ul>
<li>Добавлен раздел «Уведомления» для настройки email-уведомлений о новых заказах, изменениях статуса заказа и т. д.</li>
<li>Добавлена поддержка зависимых полей контактов, список значений которых зависит от значений других полей. Например, список станций метро в зависимости от выбранного города — используется для настройки процедуры оформления заказа.</li>
<li>Добавлена возможность авторизации через социальные сети при публикации отзыва к товару на витрине.</li>
<li>Выбранная наклейка (например, «Новинка!») распространяется на все изображения товара.</li>
<li>Добавлен модуль оплаты WebMoney (можно установить через Инсталлер в разделе «Плагины»).</li>
<li>Добавлен новый тип адресов страниц товаров и категорий — «Естественный». Его можно выбрать в настройках поселения магазина.</li>
<li>Добавлена возможность указать «старую» цену для каждой вариации товара. «Старая» цена отображается на витрине зачёркнутой — рядом с обычной ценой.</li>
<li>Исправления и улучшения темы дизайна: отображение блоков перекрёстных продаж и списков альтернативных товаров (upselling), отображение рейтинга товаров, автоматическая загрузка содержимого (lazy loading) и др.</li>
<li>Мелкие улучшения и исправления недочётов.</li>
</ul>";s:8:"datetime";s:19:"2013-02-25 00:21:00";}}s:7:"reviews";a:2:{s:5:"count";s:2:"31";s:3:"url";s:47:"https://www.webasyst.ru/store/app/shop/reviews/";}s:4:"size";N;s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:10:">=1.5.6.17";s:6:"strict";b:1;}}s:10:"is_premium";b:0;s:5:"theme";N;s:16:"publish_datetime";s:19:"2013-09-05 09:52:01";s:7:"inbuilt";b:0;}}